Catalogs/РассылкиУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>РассылкиУведомлений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидУведомления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияМоментаУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияМоментаУведомления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалУведомления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияИнтервалаУведомления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияИнтервалаУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкземплярТипаПредмета</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомленийФиксированные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПолучательУведомлений</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтактнойИнформации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонСообщения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомленийДинамические</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтактнойИнформации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонСообщения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыТранспортаУведомлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыТранспортаУведомлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Email</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обсуждения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/РассылкиУведомлений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает экземпляр типа предмета переданного вида уведомления
// в виде пустой ссылки типа.
//
// Параметры:
//  ВидУведомления - СправочникСсылка.ВидыУведомлений - Ссылка на Вид уведомления, экземпляр предмета которого,
//                                                      необходимо получить.
//
// Возвращаемое значение:
//  ЭкземплярТипаПредмета - ЛюбаяСсылка - пустая ссылка типа предмета вида уведомления.
//
Функция ЭкземплярТипаПредмета(ВидУведомления) Экспорт
	
	Если ЗначениеЗаполнено(ВидУведомления) Тогда 
		ОписаниеДанныхВидаУведомления = УведомленияСервер.ОписаниеДанныхУведомления(ВидУведомления);
		Если ОписаниеДанныхВидаУведомления.ТипПредмета <> Неопределено Тогда
			ЭкземплярТипаПредмета = ОписаниеДанныхВидаУведомления.ТипПредмета.ПривестиЗначение();
		КонецЕсли;
	Иначе
		ЭкземплярТипаПредмета = Неопределено;
	КонецЕсли;
	Возврат ЭкземплярТипаПредмета;
	
КонецФункции

// Устанавливает свойства поля ввода вида контактной информации:
// - Корректирует состав кнопок поля
// - Заполняет список выбора доступной для данного вида транспорта
// Параметры:
//  Элемент			- ПолеФормы - Настраиваемый элемент управления 
//  ВидТранспорта	- ПеречислениеСсылка.ВидыТранспортаУведомлений - 	Используемый вид транспорта, 
//																	 	влияет на тип выбираемой контактной информации
//  ОписаниеТипов	- ОписаниеТипов - тип владельца контактной информации
//
Процедура ОформитьЭлементУправленияВидаКонтактнойИнформации(Элемент, ВидТранспорта, ОписаниеТипов) Экспорт
	
	Элемент.СписокВыбора.Очистить();
	
	Элемент.КнопкаВыпадающегоСписка = Ложь;
	Элемент.КнопкаВыбора = Истина;
	Элемент.КнопкаОчистки = Ложь;
	Элемент.КнопкаРегулирования = Ложь;
	Элемент.КнопкаОткрытия = Ложь;
	Элемент.КнопкаСоздания = Ложь;	
	Элемент.РежимВыбораИзСписка = Истина;
	Элемент.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
	
	// Установим список выбора доступных видов КИ по типу объекта и типа
	Если ВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаУведомлений.Email") Тогда
		ТипКонтактнойИнформации = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты");
	ИначеЕсли ВидТранспорта = ПредопределенноеЗначение("Перечисление.ВидыТранспортаУведомлений.SMS") Тогда
		ТипКонтактнойИнформации = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон");
	Иначе
		ТипКонтактнойИнформации = ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.ПустаяСсылка");
	КонецЕсли;
	
	ТаблицаДоступнойКонтактнойИнформации = ТаблицаВидовКонтактнойИнформацииДляТипаПредмета(ОписаниеТипов);
	
	Для Каждого Строка Из ТаблицаДоступнойКонтактнойИнформации Цикл
		Если Строка.Тип = ТипКонтактнойИнформации Тогда
			Элемент.СписокВыбора.Добавить(Строка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возвращает активные рассылки уведомлений по указанному виду транспорта.
//
// Параметры:
//  ВидТранспорта - ПеречислениеСсылка.ВидыТранспортаУведомлений - вид транспорта, для которого необходимо получить рассылки
//
// Возвращаемое значение:
//  Массив - коллекция ссылок на активные рассылки уведомлений
Функция РассылкиПоВидуТранспорта(ВидТранспорта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РассылкаУведомлений.Ссылка
	|ИЗ
	|	Справочник.РассылкиУведомлений КАК РассылкаУведомлений
	|ГДЕ
	|	РассылкаУведомлений.ВидТранспорта = &ВидТранспорта";
	Запрос.УстановитьПараметр("ВидТранспорта", ВидТранспорта);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());

КонецФункции

// Отменяет активные рассылки уведомлений по указанному виду транспорта.
//
// Параметры:
//  АктивныеРассылки - Массив - коллекция, содержащая ссылки на активные рассылки уведомлений
//
Процедура ОтменитьРассылки(АктивныеРассылки) Экспорт

	НачатьТранзакцию();
	Попытка
		Для Каждого Рассылка Из АктивныеРассылки Цикл
			Попытка
				РассылкаОбъект = Рассылка.Ссылка.ПолучитьОбъект();
				РассылкаОбъект.Заблокировать();
				РассылкаОбъект.Подготовлена = Ложь;
				РассылкаОбъект.ВидТранспорта = Перечисления.ВидыТранспортаУведомлений.Email;
				ОчиститьПолучателейУведомлений(РассылкаОбъект.ПолучателиУведомленийДинамические);
				ОчиститьПолучателейУведомлений(РассылкаОбъект.ПолучателиУведомленийФиксированные);
				РассылкаОбъект.Записать();
			Исключение
				ТекстСообщения = СтрШаблон(НСтр("ru = 'В данный момент изменение настройки невозможно,
					| так как рассылка уведомлений %1 редактируется другим пользователем.'"), Рассылка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				ОтменитьТранзакцию();
				Прервать;
			КонецПопытки;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Возвращает массив рассылок уведомлений по указанному отправителю.
//
// Параметры:
//  Отправитель - СправочникСсылка.Пользователи - Ссылка на отправителя рассылки уведомлений
//
// Возвращаемое значение:
//  Массив - Массив ссылок на рассылки уведомлений
//
Функция РассылкиПоОтправителю(Отправитель) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РассылкаУведомлений.Ссылка
	|ИЗ
	|	Справочник.РассылкиУведомлений КАК РассылкаУведомлений
	|ГДЕ
	|	РассылкаУведомлений.Отправитель = &Отправитель
	|	И НЕ РассылкаУведомлений.ПометкаУдаления
	|	И РассылкаУведомлений.Подготовлена
	|	И РассылкаУведомлений.ВидТранспорта = ЗНАЧЕНИЕ(Перечисление.ВидыТранспортаУведомлений.Обсуждения)";
	
	Запрос.УстановитьПараметр("Отправитель", Отправитель);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());

КонецФункции

// Обновляет отправителя в указанных рассылках.
//
// Параметры:
//  Рассылки - Массив - Список рассылок для замены отправителя
//
Процедура ОбновитьОтправителяВРассылках(Рассылки) Экспорт

	ПользовательДляУведомлений = Константы.ПользовательДляУведомлений.Получить();
	
	Для Каждого Рассылка Из Рассылки Цикл
		Попытка
			РассылкаОбъект = Рассылка.Ссылка.ПолучитьОбъект();
			РассылкаОбъект.Заблокировать();
			РассылкаОбъект.Отправитель = ПользовательДляУведомлений;
			РассылкаОбъект.Записать();
		Исключение
			ТекстСообщения = СтрШаблон(НСтр("ru ='Не удалось записать рассылку %1.
				|Возможно рассылка редактируется другим пользователем.'"), Рассылка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Продолжить;
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

// Очищает табличную часть получателей уведомлений, сбрасывая вид контактной информации и шаблон сообщения.
//
// Параметры:
//   ТабличнаяЧасть - ТабличнаяЧастьДокумента - табличная часть, которую необходимо очистить
//
Процедура ОчиститьПолучателейУведомлений(ТабличнаяЧасть) Экспорт
	Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
		СтрокаТаблицы.ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ПустаяСсылка();
		СтрокаТаблицы.ШаблонСообщения = Справочники.ШаблоныСообщений.ПустаяСсылка();
	КонецЦикла;
КонецПроцедуры

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ОбновитьОтправителяВРассылках", Истина);
	Методы.Вставить("ОтменитьРассылки", Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаВидовКонтактнойИнформацииДляТипаПредмета(ОписаниеТипов)
	
	СсылкаОбъекта = ОписаниеТипов.ПривестиЗначение();
	// Абстракция до сотрудников
	Если ТипЗнч(СсылкаОбъекта) = Тип("СправочникСсылка.Сотрудники") ИЛИ ТипЗнч(СсылкаОбъекта) = Тип("СправочникСсылка.Пользователи") Тогда
		СсылкаОбъекта = Справочники.ФизическиеЛица.ПустаяСсылка();
	ИначеЕсли ТипЗнч(СсылкаОбъекта) = Тип("СправочникСсылка.Кандидаты") Тогда
		СсылкаОбъекта = Справочники.ЛичныеДанныеКандидатов.ПустаяСсылка();
	КонецЕсли;
	
	ТаблицаКонтактнойИнформацииДляВидов = ВидыКонтактнойИнформацииОбъекта(СсылкаОбъекта);
	УведомленияПереопределяемый.ПриПолученииСпискаКонтактнойИнформацииДляВидов(ТаблицаКонтактнойИнформацииДляВидов, ОписаниеТипов);
	
	Возврат ТаблицаКонтактнойИнформацииДляВидов;
	
КонецФункции

// Виды контактной информации объекта.
//
// Параметры:
//  ВладелецКонтактнойИнформации - ЛюбаяСсылка, Объект, ДанныеФормыСтруктура
//
// Возвращаемое значение:
//  ТаблицаЗначений - виды контактной информации.
//
Функция ВидыКонтактнойИнформацииОбъекта(ВладелецКонтактнойИнформации, ТипКонтактнойИнформации = Неопределено) Экспорт
	
	Если ТипЗнч(ВладелецКонтактнойИнформации) = Тип("ДанныеФормыСтруктура") Тогда
		ТипСсылки = ТипЗнч(ВладелецКонтактнойИнформации.Ссылка)
		
	ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ВладелецКонтактнойИнформации)) Тогда
		ТипСсылки = ТипЗнч(ВладелецКонтактнойИнформации);
	Иначе
		ТипСсылки = ТипЗнч(ВладелецКонтактнойИнформации.Ссылка)
	КонецЕсли;
	
	МетаданныеСправочника = Метаданные.НайтиПоТипу(ТипСсылки);
	ПолноеИмяОбъектаМетаданных = МетаданныеСправочника.ПолноеИмя();
	ИмяГруппыВидовКИ = СтрЗаменить(ПолноеИмяОбъектаМетаданных, ".", "");
	ГруппаВидовКИ = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка КАК Ссылка,
	|ВЫБОР
	|	КОГДА ВидыКонтактнойИнформации.ИмяПредопределенногоВида <> """"
	|	ТОГДА ВидыКонтактнойИнформации.ИмяПредопределенногоВида
	|	ИНАЧЕ ВидыКонтактнойИнформации.ИмяПредопределенныхДанных
	|КОНЕЦ КАК ИмяПредопределенногоВида
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.ЭтоГруппа = ИСТИНА
	|	И ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ
	|	И ВидыКонтактнойИнформации.Используется = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл 
		Если СтрСравнить(РезультатЗапроса.ИмяПредопределенногоВида, ИмяГруппыВидовКИ) = 0 Тогда
			ГруппаВидовКИ = РезультатЗапроса.Ссылка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ГруппаВидовКИ) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка,
	|	ВидыКонтактнойИнформации.Представление,
	|	ВидыКонтактнойИнформации.Наименование,
	|	ВидыКонтактнойИнформации.РазрешитьВводНесколькихЗначений,
	|	ВидыКонтактнойИнформации.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания,
	|	ВидыКонтактнойИнформации.Тип
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.Родитель = &ГруппаВидовКИ
	|	И ВидыКонтактнойИнформации.ПометкаУдаления = ЛОЖЬ
	|	И ВидыКонтактнойИнформации.Используется = ИСТИНА
	|	И &ОтборТипаКонтактнойИнформации
	|
	|УПОРЯДОЧИТЬ ПО
	|	РеквизитДопУпорядочивания";
	
	Если ТипКонтактнойИнформации <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборТипаКонтактнойИнформации", 
			"ВидыКонтактнойИнформации.Тип = &ТипКонтактнойИнформации");
		Запрос.УстановитьПараметр("ТипКонтактнойИнформации", ТипКонтактнойИнформации);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборТипаКонтактнойИнформации", "Истина");
	КонецЕсли;
	Запрос.УстановитьПараметр("ГруппаВидовКИ", ГруппаВидовКИ);
		
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
